/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_islower.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: pprikazs <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2017/11/09 12:01:25 by pprikazs          #+#    #+#             */
/*   Updated: 2017/11/15 13:15:35 by pprikazs         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/*
** Verifie si la valeur int passé en parametre correspond à une minuscule.
*/

int		ft_islower(int c)
{
	return ((96 < c && c < 123) ? 1 : 0);
}
